based on Org version 8.2.10 (release_8.2.10-41-g42228a). Emacs version 24.4.1

**** 时间计算.
   前面讲过表格支持时间计算.表格支持的时间格式为 HH:MM[:SS], 
   其中SS是可选, 如果公式后面接";T", 计算结果会展示为 HH:MM:SS.
   如果为";t", 计算结果为小时的小数表示. 下面的例子展示了这一点:
   #+BEGIN_EXAMPLE
       |  Task 1 |   Task 2 |    Total |
       |---------+----------+----------|
       |    2:12 |     1:47 | 03:59:00 |
       | 3:02:20 | -2:07:00 |     0.92 |
       #+TBLFM: @2$3=$1+$2;T::@3$3=$1+$2;t
   #+END_EXAMPLE
**** 查找功能
 orgmode提供了三个查找函数用于在表中进行查找:
 + (org-lookup-first VAL S-LIST R-LIST &optional PREDICATE)
   在S-LIST中查找第一个 (PREDICATE VAL S)值为t的S. 并返回R-LIST与S位置相同的
   值. PREDICATE的默认值为 equal, 如果R-LIST为nil, 则返回S.
 + (org-lookup-first VAL S-LIST R-LIST &optional PREDICATE)
   与上一个函数意义相同, 不过是先查找最后一个.
 + (org-lookup-first VAL S-LIST R-LIST &optional PREDICATE)
   相似函数. 不过返回的是一个列表.

 下面是一个示例, 更多示例看这篇文章: http://orgmode.org/worg/org-tutorials/org-lookups.html
  #+TBLNAME: rates
 | currency        | abbreviation | euros |
 |-----------------+--------------+-------|
 | euro            | eur          |     1 |
 | Norwegian krone | nok          |  0.14 |
 | Swedish krona   | sek          |  0.12 |
 | US dollar       | usd          |  0.77 |

 #+TBLNAME: cost
 |  date | expense          |  sum | currency |   rate |  euros |   |
 |-------+------------------+------+----------+--------+--------+---|
 |  1.3. | flights          |  324 | eur      |      1 |    324 |   |
 |  4.6. | books and maps   |  243 | usd      |   0.77 | 187.11 |   |
 | 30.7. | rental car       | 8300 | sek      |   0.12 |   996. |   |
 |  2.7. | hotel            | 1150 | sek      |   0.12 |   138. |   |
 |  2.7. | lunch            |  190 | sek      |   0.12 |   22.8 |   |
 |  3.7. | fishing licenses | 1400 | nok      |   0.14 |   196. |   |
 |  3.7. | gasoline         |  340 |          | #ERROR | #ERROR |   |
  #+TBLFM: $5='(org-lookup-first $4 '(remote(rates,@2$2..@>$2)) '(remote(rates,@2$3..@>$3)))::$6=$5*$3
 第一个函数查找cost表的第四列和rates表的第二列相同的值, 并将查找结果对应的
 rates表的第三列填充到cost表的第五列, 然后计算第六列的值.
 #+TBLFM: $7
